read_verilog -sv src/Mega/satswarmv2_pkg.sv
read_verilog -sv src/Mega/mega_pkg.sv
read_verilog -sv src/Mega/utils/sfifo.sv
read_verilog -sv src/Mega/pse.sv
chparam -set MAX_VARS 256 pse
chparam -set MAX_CLAUSES 128 pse
chparam -set MAX_LITS 256 pse
hierarchy -check -top pse
proc
opt
stat
