
    # Read modified package FIRST
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/resource_estimation/temp_pkg_run_1.sv
    
    # Read other source files
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/utils/sfifo.sv
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/interface_unit.sv
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/trail_manager.sv
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/vde_heap.sv
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/vde.sv
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/stats_manager.sv
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/resync_controller.sv
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/pse.sv
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/cae.sv
    read_verilog -sv /Users/tatestaples/Code/SatSwarmV2/src/Mega/solver_core.sv
    
    # Override top module parameters
    chparam -set MAX_VARS 8 solver_core
    chparam -set MAX_CLAUSES 80 solver_core
    chparam -set MAX_LITS 320 solver_core
    
    # Synthesis
    hierarchy -check -top solver_core
    proc
    opt -fast
    memory -nomap
    opt -fast
    
    # Flatten helps with estimation accuracy for generic cell counts
    # synth_xilinx -family xc7 -top solver_core -flatten -abc9
    synth_xilinx -family xc7 -top solver_core
    
    # Report
    stat
    